<?php
use Illuminate\Database\Seeder;
use App\author;
use App\category;
use App\publisher;
use App\book;


class bookseeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $book1 = book::create([
            "category_id" => category::where("name","علم الفلسفة والمنطق")->first()->id,
            "publisher_id" => publisher::where("name","دار الحضارة للنشر والتوزيع")->first()->id,
            "title" => "محمد صلي الله علية وسلم",
            "description"=>"أشهد أن لا إله إلا الله و أن محمداً عبده و رسوله وخاتم أنبيائه وحسبي من الحياة أملا أن أتبع سنته و أدعو دعوته و أبعث في لوائه وأحشر على قدمه وصلوات الله وسلامه على مولانا وسيدنا محمد إلى آخر الدهر.
            كانت هذه آخر السطور من كتابه الذي انهيته بعين رطبه.. بأبي وأمي انت يارسول الله. الكتاب بسيط ومختصر وأظنه بداية طريقك لقراءة سيرة النبي صلى الله عليه وسلم كاملة
            انصح به.",
            "number_of_copies" => "30",
            "number_of_pages" => "100",
            "price" => "20",
            "isbn" =>"045974645645",
            "cover_image"=>"images/covers/1.png",
            

        ]);
        $book1->authors()->attach(author::where("name",'مصطفى محمود')->first());

        $book2 = book::create([
            "category_id" => category::where("name","العمل الحر")->first()->id,
            "publisher_id" => publisher::where("name","دار أرواد")->first()->id,
            "title" => "",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "30",
            "number_of_pages" => "60",
            "price" => "200",
            "isbn" =>"000004645645",
            "cover_image"=>"images/covers/2.png",
            

        ]);
        $book2->authors()->attach(author::where("name",'محمد متولي الشعرواي')->first());

        
        $book3 = book::create([
            "category_id" => category::where("name","التسويق والمبيعات")->first()->id,
            "publisher_id" => publisher::where("name","دار الشروق")->first()->id,
            "title" => "تصميم مواقع الويب ",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "130",
            "number_of_pages" => "10",
            "price" => "100",
            "isbn" =>"000001595645",
            "cover_image"=>"images/covers/3.png",
            

        ]);
        $book3->authors()->attach(author::where("name",'محمد بن صالح العثيمين')->first());


        
        $book4 = book::create([
            "category_id" => category::where("name","التصميم")->first()->id,
            "publisher_id" => publisher::where("name","دار الفارابي")->first()->id,
            "title" => "",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "04",
            "number_of_pages" => "60",
            "price" => "20",
            "isbn" =>"000004645645",
            "cover_image"=>"images/covers/4.png",
            

        ]);
        $book4->authors()->attach(author::where("name","حنان لاشين")->first());



        
    


        
        $book5 = book::create([
            "category_id" => category::where("name","البرمجة")->first()->id,
            "publisher_id" => publisher::where("name","دار الجندي")->first()->id,
            "title" => "",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "350",
            "number_of_pages" => "210",
            "price" => "144",
            "isbn" =>"000000111115",
            "cover_image"=>"images/covers/5.png",
            

        ]);
        $book5->authors()->attach(author::where("name",'ابراهيم الفقي')->first());


        $book6 = book::create([
            "category_id" => category::where("name","الديانة الإسلامية")->first()->id,
            "publisher_id" => publisher::where("name","دار الأهلية للنشر")->first()->id,
            "title" => " ",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "350",
            "number_of_pages" => "210",
            "price" => "144",
            "isbn" =>"000000111115",
            "cover_image"=>"images/covers/6.png",
            

        ]);
        $book6->authors()->attach(author::where("name",'محمد بن إسماعيل البخاري')->first());

        $book7 = book::create([
            "category_id" => category::where("name","علم الفلسفة والمنطق")->first()->id,
            "publisher_id" => publisher::where("name","دار الحضارة للنشر والتوزيع")->first()->id,
            "title" => "محمد صلي الله علية وسلم",
            "description"=>"أشهد أن لا إله إلا الله و أن محمداً عبده و رسوله وخاتم أنبيائه وحسبي من الحياة أملا أن أتبع سنته و أدعو دعوته و أبعث في لوائه وأحشر على قدمه وصلوات الله وسلامه على مولانا وسيدنا محمد إلى آخر الدهر.
            كانت هذه آخر السطور من كتابه الذي انهيته بعين رطبه.. بأبي وأمي انت يارسول الله. الكتاب بسيط ومختصر وأظنه بداية طريقك لقراءة سيرة النبي صلى الله عليه وسلم كاملة
            انصح به.",
            "number_of_copies" => "30",
            "number_of_pages" => "100",
            "price" => "20",
            "isbn" =>"045974645645",
            "cover_image"=>"images/covers/7.png",
            

        ]);
        $book7->authors()->attach(author::where("name",'مصطفى محمود')->first());

        $book8 = book::create([
            "category_id" => category::where("name","العمل الحر")->first()->id,
            "publisher_id" => publisher::where("name","دار أرواد")->first()->id,
            "title" => "",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "30",
            "number_of_pages" => "60",
            "price" => "200",
            "isbn" =>"000004645645",
            "cover_image"=>"images/covers/8.png",
            

        ]);
        $book8->authors()->attach(author::where("name",'محمد متولي الشعرواي')->first());

        
        $book9 = book::create([
            "category_id" => category::where("name","التسويق والمبيعات")->first()->id,
            "publisher_id" => publisher::where("name","دار الشروق")->first()->id,
            "title" => "تصميم مواقع الويب ",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "130",
            "number_of_pages" => "10",
            "price" => "100",
            "isbn" =>"000001595645",
            "cover_image"=>"images/covers/9.png",
            

        ]);
        $book9->authors()->attach(author::where("name",'محمد بن صالح العثيمين')->first());


        
        $book10 = book::create([
            "category_id" => category::where("name","التصميم")->first()->id,
            "publisher_id" => publisher::where("name","دار الفارابي")->first()->id,
            "title" => "",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "04",
            "number_of_pages" => "60",
            "price" => "20",
            "isbn" =>"000004645645",
            "cover_image"=>"images/covers/10.png",
            

        ]);
        $book10->authors()->attach(author::where("name","حنان لاشين")->first());



        
    


        
        $book11 = book::create([
            "category_id" => category::where("name","البرمجة")->first()->id,
            "publisher_id" => publisher::where("name","دار الجندي")->first()->id,
            "title" => "",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "350",
            "number_of_pages" => "210",
            "price" => "144",
            "isbn" =>"000000111115",
            "cover_image"=>"images/covers/11.png",
            

        ]);
        $book11->authors()->attach(author::where("name",'ابراهيم الفقي')->first());


        $book12 = book::create([
            "category_id" => category::where("name","الديانة الإسلامية")->first()->id,
            "publisher_id" => publisher::where("name","دار الأهلية للنشر")->first()->id,
            "title" => " ",
            "description"=>"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
            هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.",
            "number_of_copies" => "350",
            "number_of_pages" => "210",
            "price" => "144",
            "isbn" =>"000000111115",
            "cover_image"=>"images/covers/12.png",
            

        ]);
        $book12->authors()->attach(author::where("name",'محمد بن إسماعيل البخاري')->first());




        
        

    }
}
